# Дана строка. Преобразовать в ней все прописные латинские буквы в строчные
s = input('введите строку ')
print(s.lower())